<?php if (!defined('BASEPATH')) exit('No direct script access allowed');
/****************************************************************
 * 港股行情API-全局变量配置
 *---------------------------------------------------------------
 * Copyright (c) 2004-2015 CNFOL Inc. (http://www.cnfol.com)
 *---------------------------------------------------------------
 * $author:wujg $addtime:2015-09-03
 ****************************************************************/

/* 港股休市日,每年初需要手动配置一次 */
$config['hk_holidays'] = array('2015-09-28','2015-10-01','2015-10-21','2015-12-25');

/* 
	港股股票分类配置

	全部港股   64511
	港股主板   64501
	沪港通     64518
	港股国企   64517
	港股红筹   64516
	港股创业版 64502
	港股涡轮   64512(无法批量查询)
*/

$config['hk_classid'] = array(64511,64501,64518,64517,64516,64502,64512);

/* 
	港股股票分类排行配置

	1:港股涨幅排名,2:港股跌幅排名,3:港股成交量排名 DESC,4:港股成交量排名 ASC,5:港股成交额排名 DESC,6:港股成交额排名 ASC,7:港股涨跌额排名 DESC,8:港股涨跌额排名 ASC
	-----------------------------------------------------------------------------------------------
	1001:港主版涨幅排名,1002:港主版跌幅排名,1003:港主版成交量排名 DESC,1004:港主版成交量排名 ASC,1005:港主版成交额排名 DESC,1006:港主版成交额排名 ASC,1007:港主版涨跌额排名 DESC,1008,港主版涨跌额排名 ASC
	-----------------------------------------------------------------------------------------------
	2001:港权证涨幅排名,2002:港权证跌幅排名,2003:港权证成交量排名 DESC,2004:港权证成交量排名 ASC,2005:港权证成交额排名 DESC,2006:港权证成交额排名 ASC,2007:港权证涨跌额排名 DESC,2008:港权证涨跌额排名 ASC
	-----------------------------------------------------------------------------------------------
	3001:港创业板涨幅排名,3002:港创业板跌幅排名,3003:港创业板成交量排名 DESC,3004:港创业板成交量排名 ASC,3005:港创业板成交额排名 DESC,3006:港创业板成交额排名 ASC,3007:港创业板涨跌额排名 DESC,3008:港创业板涨跌额排名 ASC 
	-----------------------------------------------------------------------------------------------
	4001:港A+H涨幅排名,4002:港A+H跌幅排名,4003:港A+H成交量排名 DESC,4004:港A+H成交量排名 ASC,4005:港A+H成交额排名 DESC,4006:港A+H成交额排名 ASC,4007:港A+H涨跌额排名 DESC,4008:港A+H涨跌额排名 ASC
	-----------------------------------------------------------------------------------------------
	5001:港红筹涨幅排名,5002:港红筹跌幅排名,5003:港红筹成交量排名 DESC,5004:港红筹成交量排名 ASC,5005:港红筹成交额排名 DESC,5006:港红筹成交额排名 ASC,5007:港红筹涨跌额排名 DESC,5008:港红筹涨跌额排名 ASC
	-----------------------------------------------------------------------------------------------
	6001:港国企涨幅排名,6002:港国企跌幅排名,6003:港国企成交量排名 DESC,6004:港国企成交量排名 ASC,6005:港国企成交额排名 DESC,6006:港国企成交额排名 ASC,6007:港国企涨跌额排名 DESC,6008:港国企涨跌额排名 ASC
*/

$config['hk_rankid'] = array(1,2,3,4,5,6,7,8,1001,1002,1003,1004,1005,1006,1007,1008,1001,2001,2002,2003,2004,2005,2006,2007,2008,3001,3002,3003,3004,3005,3006,3007,3008,4001,4002,4003,4004,4005,4006,4007,4008,5001,5002,5003,5004,5005,5006,5007,5008,6001,6002,6003,6004,6005,6006,6007,6008);

/* 
	港股所有指数配置

	0000100A 恒生指数
	0001400A 国企指数
	0001500A 红筹指数
	SPHKGA   创业指数
	SPHKLA   大型指数
	0000101A 恒生金融
	0000102A 恒生公用
	0000103A 恒生土地
	0000104A 恒生工商
*/
$config['hk_expid'] = array('0000100A','0001400A','0001500A','SPHKGA','SPHKLA','0000101A','0000102A','0000103A','0000104A');

/* 
	全球股市指数配置

	001001  道琼斯指数
	002004  韩国指数
	002003  日经指数
	002005  创业指数
	002001  恒生指数
*/
$config['hk_globalexpid'] = array('001001','002003','SPHKGA','002001');

/* 港股行业ID配置 */
$config['hk_industryid'] = array('1'=>'保健/生物科技','2'=>'餐饮/酒店/娱乐','3'=>'地产','4'=>'电子','5'=>'纺织/服饰制造','6'=>'工业','7'=>'公用事业','8'=>'航空','9'=>'基建','10'=>'建筑及建筑材料','11'=>'金融证券','12'=>'金属/采矿','13'=>'科技','14'=>'零售/贸易','15'=>'其他','16'=>'石油化工','17'=>'食品/饮料制造','18'=>'物流运输','19'=>'银行','20'=>'影视/传媒','21'=>'综合企业');

/* End of file hkstock_setting.php */
/* Location: ./application/config/hkstock_setting.php */